In [1]:
import numpy as np
import pandas as pd

In [2]:
my_dictionary = {"James": [40,30,np.nan], "Kirk": [20,np.nan,50], "Lars": [30,50,40]}

In [3]:
my_data_frame = pd.DataFrame(my_dictionary)

In [4]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [5]:
my_data_frame.dropna()

   James  Kirk  Lars
0   40.0  20.0    30

In [6]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [8]:
my_new_dictionary = {"James": [40,30,np.nan], "Kirk": [20,np.nan,50], "Lars": [30,50,40], "Rob": [45,np.nan,np.nan]}

In [9]:
my_new_data_frame = pd.DataFrame(my_new_dictionary)

In [10]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [12]:
my_new_data_frame.dropna(axis=1, thresh=2)

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [13]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [14]:
my_new_data_frame.fillna(20)

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0  20.0    50  20.0
2   20.0  50.0    40  20.0

In [15]:
#groupby

In [22]:
salary_dict = {"Programming Language": ["Python", "Python", "Python", "Java", "Java", "Swift"], "Name": ["A", "B", "C", "D", "E", "F"], "Salary": [100, 90, 80, 70, 60, 50]}

In [23]:
salary_frame = pd.DataFrame(salary_dict)

In [24]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      60
5                Swift    F      50

In [32]:
group_object = salary_frame.groupby("Programming Language")

In [33]:
group_object.count()

                      Name  Salary
Programming Language
Java                     2       2
Python                   3       3
Swift                    1       1

In [38]:
group_object.min()

                     Name  Salary
Programming Language
Java                    D      60
Python                  A      80
Swift                   F      50

In [39]:
group_object.max()

                     Name  Salary
Programming Language
Java                    E      70
Python                  C     100
Swift                   F      50

In [40]:
group_object.min("Salary")

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [41]:
help(group_object.min)

Help on method min in module pandas.core.groupby.groupby:

min(numeric_only: 'bool' = False, min_count: 'int' = -1, engine: "Literal['cython', 'numba'] | None" = None, engine_kwargs: 'dict[str, bool] | None' = None) method of pandas.core.groupby.generic.DataFrameGroupBy instance
    Compute min of group values.

    Parameters
    ----------
    numeric_only : bool, default False
        Include only float, int, boolean columns.

        .. versionchanged:: 2.0.0

            numeric_only no longer accepts ``None``.

    min_count : int, default -1
        The required number of valid values to perform the operation. If fewer
        than ``min_count`` non-NA values are present the result will be NA.

    engine : str, default None None
        * ``'cython'`` : Runs rolling apply through C-extensions from cython.
        * ``'numba'`` : Runs rolling apply through JIT compiled code from numba.
            Only available when ``raw`` is set to ``True``.
        * ``None`` : Defaults to ``'cython'`` or globally setting ``compute.use_numba``

    engine_kwargs : dict, default None None
        * For ``'cython'`` engine, there are no accepted ``engine_kwargs``
        * For ``'numba'`` engine, the engine can accept ``nopython``, ``nogil``
            and ``parallel`` dictionary keys. The values must either be ``True`` or
            ``False``. The default ``engine_kwargs`` for the ``'numba'`` engine is
            ``{'nopython': True, 'nogil': False, 'parallel': False}`` and will be
            applied to both the ``func`` and the ``apply`` groupby aggregation.

    Returns
    -------
    Series or DataFrame
        Computed min of values within each group.

    Examples
    --------
    For SeriesGroupBy:

    >>> lst = ['a', 'a', 'b', 'b']
    >>> ser = pd.Series([1, 2, 3, 4], index=lst)
    >>> ser
    a    1
    a    2
    b    3
    b    4
    dtype: int64
    >>> ser.groupby(level=0).min()
    a    1
    b    3
    dtype: int64

    For DataFrameGroupBy:

    >>> data = [[1, 8, 2], [1, 2, 5], [2, 5, 8], [2, 6, 9]]
    >>> df = pd.DataFrame(data, columns=["a", "b", "c"],
    ...                   index=["tiger", "leopard", "cheetah", "lion"])
    >>> df
              a  b  c
      tiger   1  8  2
    leopard   1  2  5
    cheetah   2  5  8
       lion   2  6  9
    >>> df.groupby("a").min()
        b  c
    a
    1   2  2
    2   5  8

In [42]:
group_object.min(numeric_only=True)

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [43]:
group_object.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
Java                    2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                   1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [46]:
my_dict1 = {"Name": ["A", "B", "C", "D"],
          "Sports": ["Basketball", "Football", "Tennis", "Running"],
          "Calories": [100,200,300,400]}

In [58]:
my_frame1 = pd.DataFrame(my_dict1, index=[0,1,2,3])

In [59]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [49]:
my_dict2 = {"Name": ["E", "F", "G", "H"],
          "Sports": ["Basketball", "Football", "Tennis", "Running"],
          "Calories": [200,50,330,440]}

In [60]:
my_frame2 = pd.DataFrame(my_dict2, index=[4,5,6,7])

In [61]:
my_frame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H     Running       440

In [52]:
my_dict3 = {"Name": ["I", "J", "K", "L"],
          "Sports": ["Basketball", "Football", "Tennis", "Running"],
          "Calories": [300,150,320,410]}

In [62]:
my_frame3 = pd.DataFrame(my_dict3, index=[8,9,10,11])

In [63]:
my_frame3

   Name      Sports  Calories
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [55]:
#concat

In [64]:
pd.concat([my_frame1, my_frame2, my_frame3])

   Name      Sports  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D     Running       400
4     E  Basketball       200
5     F    Football        50
6     G      Tennis       330
7     H     Running       440
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [57]:
#merge

In [67]:
pd.merge(my_frame1, my_frame2, on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         330
3      D     Running         400      H         440

In [68]:
new_salary_frame = pd.DataFrame({"Name": ["James", "Kirk", "Lars"],
                               "Salary": [10,20,30], "Age": [60,65,70],
                                "Age": [60,65,70]})

In [69]:
new_salary_frame

    Name  Salary  Age
0  James      10   60
1   Kirk      20   65
2   Lars      30   70

In [71]:
new_salary_frame["Name"].unique()

array(['James', 'Kirk', 'Lars'], dtype=object)

In [72]:
new_salary_frame["Name"].nunique()

3

In [73]:
def grossToNet(salary):
    return salary * 0.65

In [74]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64